package com.example.med;

public class QuestionLibrary {

    public static String[] questions = new String [] {
            "При бессознательном состоянии пострадавшего и при травмах пульс проверяется на сонной артерии",
            "При проведении ИВЛ (искусственной вентиляции легких) методом «рот в нос» необходимо свободной рукой плотно удерживать нижнюю челюсть пострадавшего, чтобы его рот был закрыт",
            "Для определения наличия дыхания при бессознательном состоянии пострадавшего нужно поднести к носу пострадавшего внутреннюю сторону своего запястья или щеку",
            "Ритм сердечно-легочной реанимации, выполняемой при оказании первой помощи: 30 надавливаний на грудную клетку – 2 вдувания воздуха",
            "Особенности проведения ИВЛ (искусственной вентиляции легких) детям: увеличивается частота вдуваний воздуха с обязательным уменьшением объема вдуваемого воздуха",
            "Частота вдуваний воздуха в минуту при проведении ИВЛ (искусственной вентиляции легких) составляет: 8-10 вдуваний в минуту для взрослых, 12-20 для детей",
            "Положение пострадавшего при проведении сердечно-легочной реанимации: на спине, на ровной жесткой поверхности (колени реанимирующего на уровне спины пострадавшего)",
            "При проведении ИВЛ (искусственной вентиляции легких) методом «рот в рот» необходимо: свободной рукой плотно зажимать нос пострадавшего",
            "Вторым действием (вторым этапом) при оказании первой помощи является: устранение состояния, угрожающего жизни и здоровью пострадавшего",
            "Правильная транспортировка пострадавшего, находящегося без сознания (за исключением случаев, когда в связи с подозрением на травму позвоночника менять положение тела не рекомендуется) производится: в положении на боку",
            "При вынужденном длительном наложении кровоостанавливающий жгут необходимо: периодически ослаблять, применяя на это время пальцевое прижатие, затем переносить выше прежнего места наложения",
            "При ожоговой ране необходимо наложить чистую увлажненную повязку",
            "Если пострадавший находится в сознании и задыхается, или у него имеется ранение грудной клетки, до прибытия скорой помощи он должен быть переведен в положение полусидя",
            "Порядок оказания первой помощи при открытых переломах: обезболить (по возможности), наложить повязку, наложить шину",
            "Действия по помощи пострадавшему при попадании инородного тела в дыхательные пути: нагнуть туловище пострадавшего вперед, нанести несколько интенсивных ударов ладонью между лопаток, при отсутствии эффекта - провести прием «Хемлика»",
            "При повреждении костей предплечья или голени шину накладывают: с захватом двух суставов (выше и ниже места перелома)",
            "При нахождении ножа или другого ранящего предмета в ране нужно: оставить ранящий предмет в ране, зафиксировать предмет в ране, наложив вокруг него ",
            "При повреждении костей плеча или бедра шину накладывают: с захватом трех суставов (двух ниже и одного выше места перелома)",
            "Если у пострадавшего развился приступ эпилепсии (судорожный приступ) нужно придерживать пострадавшего за голову, для предотвращения укуса языка и его западения ввести в рот ложку, по окончанию приступа перевести в устойчивое боковое положение",
            "Время наложения кровоостанавливающего жгута: летом – не более чем на 1 час, зимой – не более чем на 30 минут",

    };

    public static int[] images = new int [] {
            R.drawable.q1, R.drawable.q2, R.drawable.q3, R.drawable.q4,
            R.drawable.q5, R.drawable.q6, R.drawable.q7, R.drawable.q8,
            R.drawable.q9, R.drawable.q10, R.drawable.q11, R.drawable.q12,
            R.drawable.q13, R.drawable.q14, R.drawable.q15, R.drawable.q16,
            R.drawable.q17, R.drawable.q18, R.drawable.q19, R.drawable.q20
    };

    public static boolean[] answers = new boolean[]{
            true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true, true
    };

}
